ms-python.python
ms-toolsai.jupyter
ms-python.black-formatter
ms-python.vscode-pylance
ms-python.isort
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
dsznajder.es7-react-js-snippets
esbenp.prettier-vscode
humao.rest-client
codeium.codeium
continue.continue
streetsidesoftware.code-spell-checker
Sitoi.ai-commit
SonarSource.sonarlint-vscode
eamodio.gitlens
usernamehw.errorlens
aaron-bond.better-comments
sourcegraph.cody-ai
hbenl.vscode-test-explorer
vscjava.vscode-java-pack
vmware.vscode-boot-dev-pack
vmware.vscode-spring-boot
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
redhat.vscode-server-connector
